{
  "Version": "V2.0.02a",
  "Date": "2025-06-18",
  "Categories": [
    {
      "Title": "Новое",
      "Subcategories": [
        {
          "Title": "Отладка и контроль изменений",
          "Entries": [
            "Актализирован прайс;",
            "Добавлен функционал логирования критических ошибок, возникающих в процессе работы приложения. Все ошибки доступны по пути: НАСТРОЙКИ — ЛОГИРОВАНИЕ. (Логирование происходит в базу данных, которая создаётся автоматически при первом запуске. Если создать базу невозможно, логирование будет недоступно). Внимание: логирование добавлено ещё не во все участки кода;",
            "Добавлено окно последних обновлений. При первом запуске обновлённой версии отображается окно с подробным описанием нововведений и исправлений. Все обновления и версии доступны по пути: СПРАВКА — ЧТО НОВОГО;",
            "Добавлен шаблон обновлений в формате JSON-файлов."
          ]
        }
      ]
    },
    {
      "Title": "Общие изменения",
      "Subcategories": [
        {
          "Title": "Об изменённой логике в расчётах с разделами и категориями",
          "Entries": [
            "Для добавления категории необходимо выбрать раздел и нажать кнопку СОЗДАТЬ КАТЕГОРИЮ — категория добавится над разделом. В противном случае категория не будет создана;",
            "Если при добавлении категории до неё уже есть разделы, а категории в расчёте ещё не было — в самом верху создаётся дополнительная категория. Логика: если где-то есть категории, не должно остаться разделов без категории. Раздел не может быть создан вне категории, если в расчёте уже есть категории;",
            "Удаление раздела (строка раздела, без содержимого, если раздел не свернут): если перед ним нет ничего, но в разделе есть элементы — удаление запрещено. Если перед ним есть категория и в разделе есть элементы — тоже запрещено. В остальных случаях (если раздел раскрыт) удаление возможно;",
            "Удаление категории (строка категории без содержимого, если она не свернута) разрешено только для второй и последующих категорий. При удалении содержимое переходит в предыдущую категорию. При попытке удалить первую категорию (самую верхнюю) появляется окно с подтверждением: «Удалить все категории и оставить только разделы?» — варианты: Да / Нет;",
            "В настройках появилась опция «НЕ ЭКСПОРТИРОВАТЬ КАТЕГОРИИ В EXCEL». В этом случае категории будут отображаться в расчёте, но не попадут в Excel. У скрытых для выгрузки категорий появится соответствующий значок;",
            "Шаблоны 1.1 — если в расчёте нет категорий, а в шаблоне они есть, программа предложит вставить шаблон с категориями в конец расчёта. При согласии в верхней части расчёта будет добавлена категория до шаблонных, иначе содержимое шаблона вставляется под выбранной строкой;",
            "Шаблоны 1.2 — если ни в расчёте, ни в шаблоне нет категорий, содержимое шаблона добавляется в самый низ расчёта;",
            "Шаблоны 2.1 — если в расчёте есть категории, а в шаблоне — нет, программа предложит создать категорию с именем шаблона и вставить в конец. При отказе вставка произойдёт под выбранной строкой;",
            "Шаблоны 2.2 — если и в расчёте, и в шаблоне есть категории, шаблон просто добавляется в конец расчёта;",
            "Теперь можно удалить все категории в расчёте, удалив первую категорию;",
            "Добавлено уведомление о невозможности добавить категорию или раздел;",
            "Уведомление о невозможности добавить категорию или раздел теперь отображается корректно;",
            "Возвращена логика «Да/Нет для всех» при проверке соответствия прайса. Если трижды подряд выбрано Да или Нет — уведомление везде да/нет. Оно возвращается, если нажать ту же кнопку 10 раз подряд после снова."
          ]
        },
        {
          "Title": "Менеджер цен",
          "Entries": [
            "Удаление стран и местных поставщиков теперь доступно с помощью клавиши Del;",
            "Перед удалением страны выводится уведомление с подтверждением действия."
          ]
        },
        {
          "Title": "Расчёт",
          "Entries": [
            "Кнопка расчёта объединена с кнопкой проверки соответствия с прайсом;",
            "При расчёте подтягиваются не только производитель и наименование, но и единица измерения;",
            "После любых изменений в расчёте требуется повторный пересчёт;",
            "Разрешено редактировать только имена разделов и категорий в соответствующих строках;",
            "В прайсе и расчёте теперь есть строки, обязательные для заполнения (Производитель, Наименование, Артикул и т. д.);",
            "Добавлен разделитель разрядов для количества и суммы;",
            "Только что добавленная позиция теперь автоматически выделяется."
          ]
        },
        {
          "Title": "Экспорт в Excel",
          "Entries": [
            "Колонка с изображением стала шире при выгрузке всех позиций без картинок;",
            "Уведомления о неверном формате удалены;",
            "В настройках добавлена галочка для экспорта категорий;",
            "Экспорт в Excel доступен только если наименование в прайсе и расчёте различаются. Если артикула нет в прайсе — экспорт запрещён."
          ]
        },
        {
          "Title": "Другое",
          "Entries": [
            "Уменьшена скорость анимации загрузки приложения;",
            "При расчёте теперь также подтягивается единица измерения."
          ]
        }
      ]
    },
    {
      "Title": "Исправления багов",
      "Subcategories": [
        {
          "Title": "Расчёт",
          "Entries": [
            "Исправлен баг с переносом раздела над категорией, если это первый элемент;",
            "Исправлен баг с отсутствием изображения при экспорте в Excel;",
            "Исправлен баг с отсутствием элементов в поиске, вызывавшим критическую ошибку;",
            "Исправлен баг, при котором добавленный раздел под скрытым разделом исчезал."
          ]
        },
        {
          "Title": "Другое",
          "Entries": [
            "Исправлены проблемы с ценой при экспорте элементов из расчёта в прайс;",
            "Исправлен баг со случайным удалением страны в менеджере цен."
          ]
        },
        {
          "Title": "База данных",
          "Entries": [
            "Изменена длина поля «наименование_рус» с 300 до 1000 символов в связи с длинными названиями в предоставленном прайсе. Размер базы данных увеличился с 200 МБ до 600 МБ;",
            "Исправлен баг с длительной загрузкой базы данных после получения данных с сервера."
          ]
        }
      ]
    }
  ]
}
